#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "8d5b9fa12c30405736080daa71c425b1" -> "fe1c971eda948d327faa1bf32e3c1257"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "0b8e46c88151bdc033e3e8f4d8e0d79b" -> "0f8cac69aad11ef19604253534d5f6bf"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "646e813ae81a09a5be5db49d76ff51e1" -> "c998e4a4428f4d0f4295ef93a312d706"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "31608d4771edbe7df46237367165d598" -> "65c57621c6b920520f26350f21f8b19d"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "6da87f3df951cb02412e1d60837abfd9" -> "0bdbee5d227580d75580ede30e709c02"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "eb490f81f549b237e9925ec63d089026" -> "3cc39e2cd6925159cb3429d0a25692d0"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "55605239913900afcede2cd6658f9d53" -> "1e56d9961cd8ef1e1337f10c00e8e139"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "d6fcaa66ef94f44ac5d956d4f65e333c" -> "52a20bdbbad9c173ab5dbcaa2f539d66"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "d1d43a0cd739aafecde31faeab56824a" -> "6c29cddfb2aba52823fcbcc51d70e478"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "3396e99c9983b742fcd53919ec42eb5d" -> "99c329822b16c4aa9cf21d6849e0cfb5"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "640fd7ddc1f75710302367eca66a8b42" -> "b2239ea56c0715a3de71384a7575680c"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "64dc84e4ee774c3d5d779294dacee4f7" -> "ab02bec8a108a7d455ae06e13438dade"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "3f2e7c1600941272623a2fab95cf180e" -> "520d1def7c686def53e33db55b846b66"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "83a9cdd10956edbf9e2d654047a950bc" -> "1a48ca6e9c18ceb59686492c984a448f"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "d190b265a9c12d66a183fc5bdc83c2e2" -> "9cf581a801b5d2db919e5ebc5b3b7b6d"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.etl_script_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "etl_script_object" {
      ~ etag               = "f683b760a905beece321d1cf66f14290" -> "3e64822f9e7de7ad06d92a2f2623c305"
        id                 = "pyspark/kpinetwork_analizer.py"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "ed7ba1b922c32b6d7d5a3b761a44d5de" -> "a9c01ca84e8c45c7e0bddf3e67d825f5"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "8d5f06cf8014b9d2b8cf6df9d634ef9a" -> "03769de1fd7c9cb2eaefe4b46e5f96c0"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "e97cca8e3a301d86967e2ed97efe65bf" -> "7337354d75d46bbf3f74ccbac6b4f77b"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cc316c5f2344431051c203306af54c2c" -> "17e98a71416929027a998cda2c998fa7"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "fae8ce18b2494c0971e6b9b4c59ef3b1" -> "c0b81c1149c5d134600c0b59c1fd5fec"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "94b42f113d95349b89ec93eb869124f0" -> "7e1a819e21d799b8ee56c5bc5944c5c1"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "30d186d52f7a1fda7185270a4e0bd452" -> "f5bfd1b1a54c341f9fc72599c03720b1"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "1293d9d4879b20f63a6ace4d56efbd4c" -> "3dfad6249a49e3720fe7947553ff7704"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "10bbe41a63092368c7a24a5ee70a8ec0" -> "2b0ef41f4b16cbe3f4ec863a851e6cbc"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "e97b60079120ff8ee2502c3ad2272d49" -> "d51a338a29f22945659046de2fbb43b6"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1bc63a2c8cea9a23d36d2e9452375c22" -> "59eb0513a3c63dc9d20a497932f01b3c"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "5c0db2f84e12915d9c35ccfa25bd562f" -> "3a0d983ebd8bbaadf47e784bc7035403"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be created
  + resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "420d7eaf8e2bbe55fe1109915b42b6b0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_full_year_total_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_full_year_total_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "c58fc279eecaa704fa61d23dccebf018" -> "9117e96ad57c92e5898092007b43c857"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "6f901c5db70f6a757f2f090a941b3329" -> "a6c67e7d267442eea112f224c9851e70"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b48a924c711f128e6b6c1dea75ebeb61" -> "c6893345e90a7edf8e52fefde9754549"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "f4cf45cf4da59807d7bc3add6ebdcf9c" -> "371b348189ed9d2c2c96144e11a3a706"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "aea4d3eacbc2e101faba6310deb3ef8d" -> "ff83018c3150c7cba05719ff331021bf"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "596349635c8309f0b60203dedf91ec92" -> "8e5a5e610b8de7d57984c848c1e6d004"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "f964dd81fa9baaf22a15c78376ac96aa" -> "1f308425a5260194c65583676ad98732"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "8430fde4a46505e0c63269f653cc618a" -> "7c1eb8648d87f5ef6ec4a97f887baa56"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "12ec5803e219218ef519c09a498e195e" -> "671cd05d8c4875b880340ef6046ff988"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0d9c0fe46d1bf2ca5a33193bcdd11219" -> "56e63e5306b9f9b3b79bdcc77c486b45"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "98f9805f80e0f4bd00ea0e8d2e658d65" -> "e440a9587f35fad7250f7d146688657d"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "eb55492815c9d733b43fde7d2c277219" -> "c03abbff7e5193ac909f16cf70147296"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "3f45285197c7ad1a6ef5cf2bd77d044b" -> "4decf9e1d241ed34fbe36371f11445f0"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "ff713039b565b818cd93f998bf31a194" -> "52824506844bc70841a79c4d4c5d0788"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "29dc4fa30204fdb044f203da3017aea2" -> "44693a3a811a4e653247461caac2bea4"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f71032fe5a7416650d7cc7cf2a9ed7de" -> "f532ad508c90592a6ca1d6edf89d8d8e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "a7cb404c0b1e31209e141f0276faabfc" -> "7611174f393be319e011e33a37fad19a"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ec53ff9cefb92ebc0d2bf503ca055126" -> "edcf476eeca15ea59a1a4cb0af3c2a48"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "HL5+UEDb0+ImJlBFseLTVOxaSu+UBLqrcdtVCOFIfzs=" -> "RCs+BK0Skukgu4Row7TnR72RpWPltGqd5cuNoZ3kmQ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "nkNHI4NuGGjXCKbEdI3f0FduG4GjlAJOl5RzbM9RuS4=" -> "qXELc4ADO6vCWDuJwqgtnmQcDPDsJitMgsu+ekj7I1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "JwltGBy56hd4VeKIhVtEFkfW9YZrv//u8Q+qYmTVb9c=" -> "cMPmzWE7apmWnNpxkyq+K+GQnw3p40EaXnvYXKHQ9tU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "bPvCC1Ro9nbckUJrUdJh6KbQ9oO0VErEEpqPWBvbWhs=" -> "7mtLqFFSVxOZ3JrwXi2iVjZPrIkZLTDgbkY+niE6i5k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ICiyAP/D0ldSdjbS821FHQykHtfC5w4KwfWI3vo3BjM=" -> "oGoqSzIGtxLpBqM3+xPQk47YwB4ut4y+IFcovGbbNkE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "aZgtybtTqu0kh97WJZgLXUg8HHNOklTGt2AK3jT1TcY=" -> "NCgxKbSPS7nLuTx9pe5nFem/uNNMEYJ90I0cGYT3mio="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "mbkyH9NCN+l7qG9Ys47qwGNJa1zCGv/f2ZQTFV+bmso=" -> "8+X8sSXtsa99qQUZKDjk5xo6genTICUMgSKoD1/WXD4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "eAyWdw5SlXeG8/5fL5qXe75WKq3SKvUvR8Om7j5mhpw=" -> "2GuURTk+5Aw4rhhS2CGeQJTYqBx3p7BECgXtqv459HE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "fjEjFTtCNqRCOhBwu8Qei0X3uRdwjIAFNv2h7ima5YY=" -> "8rHhdyQAl3VeJeGLVhqWZXmN/TaxGCS7C8o0UGMq2zk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "gixqEwVvfCGzWT60SjZ8DDRMogtHth5Uf8o3aj05x2k=" -> "bo0sM7oxth0Y+yUMNQP2PZa2Y7B2LwgLQL+ldEIsoJY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "vGWmN6g5BfOybQrCj1PXsXs4gbIoVs9+Ao8xagWTYqY=" -> "me6qqK5J36izVUzNj+0drIV2r9ZNAqDLgU+jMPQv0g8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "cFAf7hOxmH2DpswUNQbdpT0CLv1YWA5ZoeOs0Eh5zwg=" -> "TYGldQjLN5QuGGi+ib5YMKzJUxDbp58J3AdCyyLpMDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "p+WFjEPFnAEvZELvDhs2vni2oXT7fIK4apsCu/pbA1Q=" -> "2vEc26pt8Qu/81ug5c4I7e9NeM6m1do+dg6/S5m70Q4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "td8JkdWP8+RjZv2Y5ERtWa5Nbb+fmNoSlGzmZKltrLM=" -> "/b2RHn8rauNPwNZBQg/bV3pm13mBdHPq3E3FmvupID4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "g37OVJZYJJeGyyF9Jj0pJKsI5/dGYaJwCbWJ08gxIbA=" -> "ktWDAPev6noejhtQ0ui/226oNlLzncBYokD7pkgmMs0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "llxQSwGbGWSabtsiaACaWCMeppLVXxyHGu11f1lDrxw=" -> "wUexnoCbfaTAN4rIyDQ2aZOHpYucwBYZG5uzid37q6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "nh2JrHX0C7DZh7dPAbJszPYJRzqNKzv1RbEPDgF0Owo=" -> "ArOgd65SgxM0vmPredMvYYcq9rVt3KXpFBIf7AVEjkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "DRn/AVVjNnrVmhueezOZeauShL0OGvOhnhuK0Qwe9aE=" -> "o3FatWCqyKjgeqXcoa0lhPeljEa8VC2opCs8NOUe5Nk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "qgqBAku81+gQDLq1HpP7W6Kw/qY5YB1o0yM0YSCBs/w=" -> "E4X3W0FVIhlf+cEUJrUOGi9uJa+vPaF+V4/MJw6pe6c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "vOGQ55pszPgFPxShG0dEeitJWlcNbQpf9XEDJ5JGV+M=" -> "+LxiL+xEetwVaoWtYrXpBf8oo4RW3P+v4ptvhGndxy0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "CxeKGfDCkZ5h9HWMg+CdirfyMgPiM3y2zgfEoVHXaMc=" -> "ncPX32IxixXeswBmhPt5lOFacjegQ92nGo0Wd2dfHcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "T2mPQLwFrU9dHush4aKHXzdYgwE6j1r2k01A/Gg6Mmw=" -> "BUTewHbhwuPwcDX2DyDCb1ChdGQG0mNfDo4lBrw+IOk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "pe4wKZnWzn1Japyvr7msxaTKfhwR3mh12/YvAAfdh7k=" -> "FHyNf3j5y04vqImFN0WWgh2pHIty5D8LvlRpla60oRY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "MsZPm53mo7q10nrafJJpv7D7YNx55B0gyQyEgJH5Qb0=" -> "b5/hj6dsEBv2Bj6hobolKqx8HOf3YbZNy0En+KKPpeA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "aWZxjzqVEV23VpRFSm6QTmAzUCntaiamqBKH/qvHdVM=" -> "l3VqxzfIJj4MOcVRqFEEPBDWfwlRT77mcw4/94fZh18="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "mYQL3aL/urNdSgVUtVG+CuM5npaYcJYNpZ6uTphbmn0=" -> "EEQkyVf3n1vN+Q15hCozezTN9fBt31VGfQwSkcHWIxM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "n5bTPMktZGi3OYPTdcFEh4JYhIdUMeQpuueQyHOk8Ew=" -> "NjOx3Zfi930FqSiRofBquoTFyfDyDUyyOCViqEUocbA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be created
  + resource "aws_lambda_function" "get_full_year_total_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_full_year_total_lambda_function"
      + handler                        = "get_full_year_total_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_full_year_total_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "CvwpMUZDq1YzbWDMdn6NQmvhEMNs3KdpV9/vPJzSNuY="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive value)
              + "DB_HOST"      = (sensitive value)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive value)
              + "DB_USERNAME"  = (sensitive value)
              + "SECRET_KEY"   = (sensitive value)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "bOH6hRx7F196GENntNOSzdkaIH4zizQ9HwOUUq62SzE=" -> "G8BasKd9Txrowzz+XC+vbvuQ+9TS0ZCgoBDKz7WGxoE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "FSMelonSQaKbjeTkXKlPxyxXUF+4mL5RoX0qFpIPRnQ=" -> "KOgl/fjPVXFU/TlbMrcAkvMc79yBif2usihTWlgB7qQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "pCbLTBaWUElvoNajR1aby1Tj4Xq6StFmayYYzCRXW+Y=" -> "2oKxoxEUFuWLwGUugMzC7h2/5p2BPLfPm6yxwhwpr7A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "x8CpkQWa7N2SBkZCjCkFP6byXOyOgFE6uvuJa+rRiK0=" -> "bD7OZ77o2JDsjEovaihy21o+ISY4ekr/aVP6w1f/ihQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "t4Ku/S1PV91UdL1p7BureAbHoiooKZxEIi0n+4F50/U=" -> "oMDnZF7y32lhTt3dFIIO5yvBJQeNC4GMFHaIs+RuuRE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "xe12215GJqo/pzm+YsEtwDlSp/JUji79lhYt3C/KPhQ=" -> "W0v/Eth5JWV8fn7EpbTZpW8KccgxPzvPFzSByOumztw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "i3uqviyjNH+3BSrqKfM/E2+VIDQOAUWnzxk2OovaKAU=" -> "8FmqKMYZCGtNNAWSIlPXuCYAWpX+NUPGO4vnbmBx7o4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "4WK9KWwwJXd2cRPCsFPJT8e+N95ZhSj1vJ3O7lEBBmA=" -> "70Sl4li4GZdKb9R04Nc58Bi/SJ1BrGGRHkDimzMZsaw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "BZXdnc619kC2Z8n3/s2gEuE6QayygTp6bPiXunRgxeQ=" -> "sYJ5brPYwq1ZxSvWEQjhaZqS25pLPKK56iQvckSlLbI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "cCDOWcNTJm6qTL94+vhHDpfdsrgrYUGUJmy+UEYyurA=" -> "oMms+e9ALy269pWKBZrq96MU08mZCsX+ItB2sbkPd4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCC/jxo0fvdXATbYwKllTbcx3F2rCcMlLgi+acLMTXc=" -> "lxQ/3UttMrc5HuxweZiq5MKpK9cbpReXMEadBarNR9s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "K1IlPvCPqmFqaawYXrrHsHCFVegcRcZ9faykVDVkOCQ=" -> "k2ttjt/Ap0eBv+4ce4XSiwNDPr4DyLYUihArA/rgqQA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "ArbrJZoCQcEcjbZsEbxAPUl3cUer7TnPsyZzEwHOoa0=" -> "KMvU6i5l3+dTtBiRC9M1omus1N85BCMGTKhUhVGJC9w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "8Z1TNgRK4Kv1nmdbsQuSiJmkf1jZuLTVqVhjs/3xumw=" -> "wvfvmWv/NiUkoHJ/xK2DTvlSjaFu2okbE/KL5m4ucm4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "pptKvO2fk1AdqP2edBkrbPBHfVSl4pKxCB1ylZF+IJw=" -> "YsafiXYdM5EnhD2RC4/I5tqBAdthBnWNkeuowhtAZXs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "A5lK1tYDSOVeRUXitKN7Vm8ZWzHHq+keyMDprsvKSJI=" -> "acnz7klhLiBtEJGl4aClN7kSsWJcxcRYUjQbpRi2CMQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-29T16:39:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "mADLS7m8TnDfNVTnUoU+3gLYDy0CPfloDHidlD9mi7w=" -> "/wJjssAzB377QbHe+BBlK4YhlFrVm3EWK3q1jGbqEEc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-29T16:39:18Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "xszkdw" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-29T16:39:17Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.get_full_year_total_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_full_year_total_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_full_year_total_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_full_year_total_integration will be created
  + resource "aws_api_gateway_integration" "get_full_year_total_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.get_full_year_total_method will be created
  + resource "aws_api_gateway_method" "get_full_year_total_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.full_year will be created
  + resource "aws_api_gateway_resource" "full_year" {
      + id          = (known after apply)
      + parent_id   = "0ay34r2gi9"
      + path        = (known after apply)
      + path_part   = "full_year"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-29T16:39:16Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.get_full_year_total_lambda_exec_role will be created
  + resource "aws_iam_role" "get_full_year_total_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_full_year_total_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.get_full_year_total_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_full_year_total_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_full_year_total_cognito_policy"
      + policy = (sensitive value)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.get_full_year_total_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_full_year_total_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_full_year_total_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_full_year_total_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_full_year_total_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_full_year_total_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_get_full_year_total_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_full_year_total_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_full_year_total_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive value)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

Plan: 12 to add, 92 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*